<img src='./img/intel-logo.jpg' width=50%, Fig1> 

# 판다스 기초강의
<font size=5><b>05.계층색인<b></font>

<div align='right'>성  민  석 (Minsuk  Sung)</div>
<div align='right'>류  회  성 (Hoesung Ryu)</div>

<img src='./img/pandas-logo.png' width=50%, Fig2> 


---

<h1>강의목차<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#특정-column-선택하기" data-toc-modified-id="특정-column-선택하기-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>특정 column 선택하기</a></span></li><li><span><a href="#set_index-and-reset_index" data-toc-modified-id="set_index-and-reset_index-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>set_index and reset_index</a></span><ul class="toc-item"><li><span><a href="#set_index" data-toc-modified-id="set_index-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>set_index</a></span></li><li><span><a href="#reset_index" data-toc-modified-id="reset_index-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>reset_index</a></span></li><li><span><a href="#reset_index-&amp;-drop" data-toc-modified-id="reset_index-&amp;-drop-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>reset_index &amp; drop</a></span></li></ul></li><li><span><a href="#Logic-operation" data-toc-modified-id="Logic-operation-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Logic operation</a></span><ul class="toc-item"><li><span><a href="#OR" data-toc-modified-id="OR-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>OR</a></span></li><li><span><a href="#AND" data-toc-modified-id="AND-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>AND</a></span></li></ul></li><li><span><a href="#Multi-index(다중색인)" data-toc-modified-id="Multi-index(다중색인)-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Multi-index(다중색인)</a></span><ul class="toc-item"><li><span><a href="#swaplevel(index1,-index2,-axis)" data-toc-modified-id="swaplevel(index1,-index2,-axis)-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>swaplevel(index1, index2, axis)</a></span></li></ul></li><li><span><a href="#stack(),-unstack()-함수" data-toc-modified-id="stack(),-unstack()-함수-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>stack(), unstack() 함수</a></span><ul class="toc-item"><li><span><a href="#stack()" data-toc-modified-id="stack()-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>stack()</a></span></li><li><span><a href="#unstack()" data-toc-modified-id="unstack()-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>unstack()</a></span></li></ul></li></ul></div>

## 특정 column 선택하기

- `df.food` == `df['food']` 두개는 같은 표현이다

In [15]:
import numpy as np
import pandas as pd


# DataFrame 만들기 
df2 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                             'corned beef', 'Bacon', 'pastrami', 'honey ham',
                             'nova lox'],
                    'ounces': ['a', 'b', 'c', 'd', 'e', 'a', 'b','c', 'd']})

print("---Origin---")
display(df2)

---Origin---

          food ounces
0        bacon      a
1  pulled pork      b
2        bacon      c
3     Pastrami      d
4  corned beef      e
5        Bacon      a
6     pastrami      b
7    honey ham      c
8     nova lox      d

In [16]:
# food column 가져오기 
print("--- df2.food ---")
display(df2.food)

--- df2.food ---

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [17]:
# food 컬럼에서 bacon을 가져오기
print("--- df2.food == bacon ---")
display(df2[df2.food=='bacon'])

--- df2.food == bacon ---

    food ounces
0  bacon      a
2  bacon      c

## set_index and reset_index 

- set_index: column 중 선택 변수를 인덱스로 지정 할 수 있다.
- reset_index: index를 다시 컬럼으로 돌리거나, 삭제 시킨다.

In [18]:
np.random.seed(0)
df = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
print('---Origin DataFrame---')
display(df)

---Origin DataFrame---

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

### set_index

In [19]:
df1 = df.set_index("C1")
print('---set C1 as an index ---')
display(df1)

---set C1 as an index ---

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

### reset_index

In [20]:
df2 = df1.reset_index()
print('---reset_index---')
display(df2)

---reset_index---

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

### reset_index & drop

In [14]:
# reset_index 명령 사용시에 drop=True 로 설정하면,
# 인덱스 열을 보통의 자료열로 올리는 것이 아니라 그냥 버리게 된다.
print('---reset_index drop---')
display(df1.reset_index(drop=True))

---reset_index drop---

     C2    C3    C4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

## Logic operation

In [22]:
# df_2 = df_2[(df_2['item_type']=='adena') & df_2['item_type']=='armor']
df_c1 = df.set_index('C1')
# display(df_c1)
aa = df_c1[(df_c1.C2 == '0.55') | (df_c1.C3 == '0.6')]
bb = df_c1[(df_c1.C2 == '0.55') & (df_c1.C3 == '0.6')]
print("---Origin: ---")
display(df_c1)

---Origin: ---

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

### OR

In [23]:
# OR 둘중 하나만 참이면 참
print("---OR : (df_c1.C2 == '0.55') | (df_c1.C3 == '0.6')---")
display(aa)

---OR : (df_c1.C2 == '0.55') | (df_c1.C3 == '0.6')---

      C2    C3    C4
C1
A   0.55  0.65  0.79

### AND

In [24]:
# 둘 다 참 일떄만 참
print("---AND : (df_c1.C2 == '0.55') & (df_c1.C3 == '0.6')---")
display(bb)

---AND : (df_c1.C2 == '0.55') & (df_c1.C3 == '0.6')---

Empty DataFrame
Columns: [C2, C3, C4]
Index: []

## Multi-index(다중색인)

In [59]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
print('---oringin DataFrame---')
display(df3)

---oringin DataFrame---

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [60]:
# 컬럼이름 ["Cidx1", "Cidx2"] 로 설정하기
df3.columns.names = ["Cidx1", "Cidx2"]
print("---set columns name as ['Cidx1', 'Cidx2']---")
display(df3)

---set columns name as ['Cidx1', 'Cidx2']---

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [61]:
# 컬럼이 A인 데이터 가져오기
df3['A']

Cidx2    C1    C2
0      1.76  0.40
1      1.87 -0.98
2     -0.10  0.41
3      0.76  0.12
4      1.49 -0.21

In [62]:
# 컬럼이 A이면서 C2 인 것 조회하기 
df3[('A','C2')]

0    0.40
1   -0.98
2    0.41
3    0.12
4   -0.21
Name: (A, C2), dtype: float64

In [63]:
# 위와 같은 방식임
df3['A']['C2']

0    0.40
1   -0.98
2    0.41
3    0.12
4   -0.21
Name: C2, dtype: float64

In [64]:
# 인덱스 0부터 2까지 조회 
df3.iloc[0:3]

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45

In [65]:
# A,B 에서 C1 선택하기 
df3[[('A','C1'),('B','C1')]]

Cidx1     A     B
Cidx2    C1    C1
0      1.76  0.98
1      1.87  0.95
2     -0.10  0.14
3      0.76  0.44
4      1.49  0.31

In [66]:
# 최상위 색인이 아닌 색인으로만 인덱싱하고 싶은 경우에는 xs() 함수를 사용.
df3.xs('C1',axis=1,level=1)

Cidx1     A     B
0      1.76  0.98
1      1.87  0.95
2     -0.10  0.14
3      0.76  0.44
4      1.49  0.31

In [67]:
df3.index.set_names('rank',inplace=True)
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
rank
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

### swaplevel(index1, index2, axis)
**index1과 index2의 위치를 변경**함.   
**index1과 index2가 로우 인덱스인 경우, axis = 0, 컬럼인덱스면 1 (기본값은 0)**

In [69]:
df3.swaplevel('Cidx1','Cidx2',axis=1)

Cidx2    C1    C2    C1    C2
Cidx1     A     A     B     B
rank
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [71]:
# 컬럼 위치 변경하고, 정렬하기 
df3.swaplevel('Cidx1','Cidx2',axis=1).sort_index(axis=1)

Cidx2    C1          C2
Cidx1     A     B     A     B
rank
0      1.76  0.98  0.40  2.24
1      1.87  0.95 -0.98 -0.15
2     -0.10  0.14  0.41  1.45
3      0.76  0.44  0.12  0.33
4      1.49  0.31 -0.21 -0.85

## stack(), unstack() 함수

1. stack(level) : 컬럼 인덱스를 로우 인덱스로 옮길 때 사용.
2. unstack(level): 로우 인덱스를 컬럼 인덱스로 옮길 때 사용.
3. level 인자는 옮기고자 하는 인덱스의 위치를 표기함. 명시하지 않은 경우, 최하단의 인덱스를 이동시킴.
4. level은 최상위가 0이고, 1씩 증가함

In [75]:
# 샘플 데이터 생성
np.random.seed(0)
df = pd.DataFrame(np.random.randint(50, 100, (5, 4)), 
                  columns=[[2016, 2016, 2017, 2017], ['영어','수학','영어','수학']], 
                  index = ['Kim','Park','Lee','Jung','Moon'])

df.columns.set_names(['연도','과목'],inplace=True)
df

연도   2016     2017
과목     영어  수학   영어  수학
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

### stack()

In [76]:
# 연도 컬럼을 로우 인덱스로 변경
df.stack('연도')

과목         수학  영어
     연도
Kim  2016  97  94
     2017  53  50
Park 2016  89  53
     2017  69  59
Lee  2016  86  71
     2017  56  73
Jung 2016  74  74
     2017  51  62
Moon 2016  89  88
     2017  96  73

In [79]:
# 과목 컬럼을 로우 인덱스로 변경
df2 = df.stack('과목')

### unstack()

In [83]:
df2

연도       2016  2017
     과목
Kim  수학    97    53
     영어    94    50
Park 수학    89    69
     영어    53    59
Lee  수학    86    56
     영어    71    73
Jung 수학    74    51
     영어    74    62
Moon 수학    89    96
     영어    88    73

In [84]:
df2.unstack('과목')

연도   2016     2017
과목     수학  영어   수학  영어
Kim    97  94   53  50
Park   89  53   69  59
Lee    86  71   56  73
Jung   74  74   51  62
Moon   89  88   96  73